task-last/task-c/openfoam/task-20/init_file/dynamic_base/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    left
    {
        type            fixedValue;
        value           uniform (0.5 0 0); // TODO_INLET_FREESTREAM
    }

    right
    {
        type            zeroGradient;
    }

    down
    {
        type            slip;
    }

    up
    {
        type            slip;
    }

    cylinder
    {
        type            movingWallVelocity;
        value           uniform (0 0 0); // TODO_MOVING_WALL_VELOCITY
    }

    defaultFaces
    {
        type            empty;
    }
}

// ************************************************************************* //
